AK47n/firstep/.scratch/magnetometer-modules/matrix/hmc5883l-mspm0/mspm0.syscfg
/**
 * firstep mspm0 母版默认外设布局（地猛星 LCKFB-DMX 开发板，模块库默认引脚方案，
 * 编译闭环用；2026-08-14 地猛星化，工单 mspm0-master-dimx/01）。
 * 实例名/宏名与模块库代码一一对应（PWMAB/DC_MOTOR/IMU601/OLED/NTB/MOTOR_PID/
 * HUIDU/KEY/LED_BEEP/STEP_MOTOR/DCC_100_PWM2/I2C_0）；实际接线不同时改引脚名
 * 即可，实例名与宏名勿动。
 * 引脚方案（除 PB4/PB5 外全部在地猛星 2×20 排针上）：
 *   motor：PWMAB C0/C1→PA12/PA13、DC_MOTOR AIN1=PB9 AIN2=PA18 BIN1=PB18
 *   BIN2=PA7、编码器 AA=PA16 AB=PA17 BA=PB19 BB=PB20
 *   HUIDU：PA22-27/PB4/PB5（R3/R4 的 PB4/PB5 为 LaunchPad 遗留，地猛星未引出）
 *   KEY：PA2（板载 ROSC 偏置 100k 到地，按键与上拉共用此脚）
 *   LED_BEEP：PA15；IR_BEAM：PA8（红外对射 OUT，ir_beam 模块；与
 *   DIGIT_UART 默认重叠，同选时经引脚绑定消解）；IMU601：UART0 =
 *   PA28(TX)/PA31(RX)（板载 CH340E 占
 *   UART0 的 PA10/PA11，勿用）；DIGIT_UART：UART1 = PA8(TX)/PA9(RX)（K230 串口）
 *   OLED：I2C1 = PB3(SDA)/PB2(SCL)；I2C_0：I2C0 = PA0(SDA)/PA1(SCL)（MPU6050，
 *   复用板载 LED 脚——总线空闲高电平 LED 不亮，通信期间微闪；PA1 板载 4.7k 上拉，
 *   PA0 上拉未焊 R12，靠 MPU 板自带）
 *   STEP_MOTOR：RST2/SLP2/DIR2/DCY2 = PB24/PB6/PB7/PB8（全 GPIOB，
 *   STEP_MOTOR_PORT 整组 GPIOB）；DCC_100_PWM2：TIMG12 C0 = PA14（板上经
 *   LED2+15k 到地，PWM 输出时 LED 微亮，可忽略）
 *   JOYSTICK：SW = PA9（摇杆按键，上拉输入低有效；与 DIGIT_UART RX 默认
 *   重叠——手动摇杆与 K230 视觉同选概率最低，同选时经引脚绑定消解）；
 *   ADC12_0 八通道：MEM0 = PA24(A0_3) 归 adc 模块（us016/mq2 薄封装共读同槽），
 *   MEM1 = PA26(A0_1) / MEM2 = PA25(A0_2) 归 joystick 摇杆 X/Y（与
 *   ZIGBEE_UART 默认重叠——手动摇杆与无线身份/信标同选概率最低，同选时
 *   经引脚绑定消解；多 MEM 必须 sequence 模式，2026-09-05 SysConfig CLI
 *   实证），MEM3 = PA27(A0_0) 归 ir_distance（与 HUIDU R2 重叠——红外
 *   测距与灰度巡线同选概率最低），MEM4 = PB20(A0_6) 归 mq135、MEM5 =
 *   PB24(A0_5) 归 mq5（两件均独立通道，
 *   与 DC_MOTOR BB/SYN6288 TX、STEP_MOTOR RST2/SR04 TRIG/HC05 KEY/AT24C02 SCL
 *   重叠——MQ 系与运动控制/语音/记录常见同框概率最低；多路气体同选时物理
 *   通道独立、无共读冲突——mq2 为 MEM0 薄封装
 *   共读同槽，2026-09-08 实证 MEM4-7 通道/脚全合法），MEM6 = PA22(A0_7) 归
 *   flame 火焰传感（独立通道——AO 高阻源取剩余通道中唯一无负载脚，与
 *   HUIDU L1/DEBUG_UART RX/NRF24L01 IRQ/TTP224 OUT1 重叠——巡线巡检/无线
 *   链路/触摸面板与火警/灭火不同框、同选概率最低），MEM7 = PA14(A0_12) 归
 *   soil 土壤湿度（独立通道——**MEM 槽位已满（8/8）**：后续 ADC 类件一律
 *   薄封装共读 MEM0（mq2/us016 先例，多件同选同读一物理通道）；PA14 板载
 *   LED2+15k 为固定比率衰减（读数系统偏小、单调性保留），与步进/灯带/读卡/
 *   气体重叠——浇花/农业与运动/读卡不同框、同选概率最低）
 *   HC05：HC05_UART = UART2 共享（9600——HC05 出厂默认波特率，与 DEBUG+UWB
 *   同外设；默认 PA23/PA24 与 UWB 同脚——蓝牙与 UWB 链路互替、同选概率
 *   最低，同选时经引脚绑定换实例消解）；STATE = PA8 输入（连接状态，
 *   高有效；与 DIGIT_UART TX/IR_BEAM OUT 重叠——蓝牙与 K230 视觉/红外对射
 *   链路互替）、KEY = PB24 输出（AT 模式切换，与 STEP_MOTOR RST2/SR04 TRIG
 *   重叠——AT 切换不常用，同选经引脚绑定消解）
 *   NRF24L01：软 SPI 6 脚全 GPIOA（CLK=PA26/MOSI=PA25/MISO=PA9/
 *   CSN=PA24/CE=PA23/IRQ=PA22，单 NRF24L01_PORT 宏）——与 ZIGBEE_UART/
 *   UWB/DEBUG_UART/HUIDU 巡线/joystick/adc/DIGIT 默认重叠：NRF 与其它无线
 *   链路互替、同选概率最低，同选时经引脚绑定消解；IRQ 输入不配中断（GPIO
 *   中断只有 GROUP1 一路且被 motor 编码器独占，第二个 GROUP1_IRQHandler 会
 *   链接期冲突——按手册轮询方式接收，见 nrf24l01 模块注释）
 *   IR_REMOTE：OUT = PA26 输入（红外接收头，NEC 忙等解码不占 TIMER；
 *   与 ZIGBEE_TX/joystick X/NRF24L01 CLK 重叠——红外与其它无线/手动输入
 *   互替、同选概率最低，同选时经引脚绑定消解；主循环轮询解码，不注册
 *   GPIO 中断，原因同 NRF24L01）
 *   MAX7219：DIN=PB9/CLK=PA18/CS=PB18 输出（数码管/点阵显示，软 SPI 位
 *   操作不占硬件 SPI——与 DC_MOTOR AIN1/AIN2/BIN1 重叠：大数字显示（计分/
 *   计时/数据牌）与双电机小车同选概率最低，同选时经引脚绑定消解；PA18 兼
 *   BSL 排针脚，作输出无碍）
 *   PCA9685：SCL=PB6/SDA=PB7（16 路舵机驱动板，软 I2C 位操作不占硬件 I2C
 *   外设，SDA 方向运行时切换——与 STEP_MOTOR SLP2/DIR2、HUIDU R3/R4、
 *   AHT10/DHT11 温湿度重叠：多路舵机多自由度执行与温湿度采集/步进（互替）/
 *   巡线车同选概率最低，同选时经引脚绑定消解；软 I2C 需板上/模块自带上拉）
 *   IR_TX：OUT = PA0 输出（红外编码发射，38kHz 载波忙等不占 TIMER——与
 *   I2C_0 SDA（ml_mpu6050 姿态）/板载 LED 重叠：红外发射链与姿态采集同选
 *   概率最低，板载 LED 随载波闪烁可作发射指示；与 IR_REMOTE 默认 PA26 刻意
 *   错开——发射/接收常配对，双选默认即不撞，同选时经引脚绑定消解）
 *   LCD：软 SPI 6 脚全输出（SCL=PA16/SDA=PA17/RES=PA27/DC=PA22/CS=PB19/
 *   BLK=PB20——与 DC_MOTOR 编码器 AA/AB、RC522、ADS1115/SHT20 SCL/SDA、HUIDU
 *   L1/R2、NRF IRQ、ZIGBEE/DEBUG RX、TTP224、flame、JQ8900/SYN6288、mq135
 *   默认重叠：彩屏与巡线车/无线链路/语音播报/触摸/读卡/气体互替不同框、同选
 *   概率最低（刻意不叠显示族与环境站/PA0-PA1——i2c_bus_share 测试互扰，
 *   批次 5 实测先例），同选时经引脚绑定消解；六屏合一模块（ST7735/ST7789/
 *   GC9A01），软 SPI 位操作不占硬件 SPI 外设——max7219 先例）
 * 板上固定占用：CH340E PA10/PA11、Flash PB14-17、晶振 PA3-6、板载 LED PA0/PA1、
 * VREF- PA21 直连地、BSL PA18（47k 到 BSL 排针）、SWD PA19/PA20（独立 DEBUG 排针，
 * 用户实物未在 2×20P 上找到 A19/A20）、NRST。2026-08-20 用户实物核验：芯片丝印
 * 可见 42WG4 / ABDL，外周为 48 脚，2×20P 排针分布正确，PA13/PA14 在排针上可用。
 * TI 封装命名中 LQFP(PT)=48 脚、LQFP(PM)=64 脚；当前 SysConfig 仍沿用可工作的
 * LQFP-64(PM) / LP-MSPM0G3507 模型，不以此反推实物脚数。实际地猛星 2×20P
 * 引出范围由 mspm0-dimx 板定义约束，PB4/PB5 为 LaunchPad 遗留模型脚、不在 2×20P 上。
 */
//@cliArgs --device "MSPM0G350X" --package "LQFP-64(PM)" --part "Default"
//@v2CliArgs --device "MSPM0G3507" --package "LQFP-64(PM)"
// @cliArgs --board /ti/boards/LP_MSPM0G3507 --rtos nortos

/**
 * Import the modules used in this configuration.
 */
// 舵机（servo 模块：50Hz/20ms 周期，0.5-2.5ms 脉宽映射 0-180°；周期由
// servo_init 按 SERVO_PWM_INST_CLK_FREQ 运行时配置，此处初值仅保证可编译）
const GPIO    = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const HMC5883L = GPIO.addInstance();
const SYSCTL  = scripting.addModule("/ti/driverlib/SYSCTL");

/**
 * Write custom configuration values to the imported modules.
 */

// 电机 PWM：双通道 C0/C1（TB6612 左/右 PWM 输入）

// 步进电机脉冲输出（step_motor 模块：DCC_100_PWM2_INST，TIMG12 32 位定时器，
// clockPrescale 必须为 1——step_set_speed 按 INST_CLK_FREQ/频率 直算周期；C0 = PA14）

// L298N 大电流电机驱动（l298n 模块：IN1/IN2 双通道 PWM 方向+调速（页面
// AO_Control 原样：dir=1 → C0=0/C1=duty、dir=0 → C0=duty/C1=0）+ EN 使能
// GPIO（三脚一组）。L298N_PWM = TIMG12（32MHz BUSCLK/1 预分频/2000 计数 ≈
// 16kHz——与 DCC_100_PWM2 同外设：L298N 与步进驱动互替、同选概率最低，
// 同选时经引脚绑定换实例消解）；默认 C0=PA14 / C1=PB24——与 DCC_100_PWM2
// （步进脉冲）、WS2812 IN（灯带）、SR04 TRIG（测距）、RC522 SCK（读卡）、
// AGS10 SDA/soil（气体/土壤）、HC05 KEY、AT24C02 SCL、mq5、STEP_MOTOR RST2
// 重叠：大电流驱动与步进/测距/读卡/存储/气体不同框、同选概率最低（刻意
// 与 motor 默认 10 脚错开——两驱动同选概率低但可能并排使用，默认即不撞）

// L298N 使能脚（l298n 模块：EN 输出高有效——页面「5V 使能高电平有效，常态
// 下跳线帽接 VCC」；本件 l298n_init 置高（配合取跳线帽 + GPIO 使能），初始
// SET = 使能。默认 PA27——与 HUIDU R2（8 路灰度巡线）、ADC12_0 adcPin0
// （ir_distance MEM3）、TTP224 OUT4（触摸按键）重叠：使能脚与巡线（巡线车
// 惯用轻量 TB6612，与大电流驱动不同框）/模拟测距/触摸面板不同框、同选概率
// 最低，同选时经引脚绑定消解）

// 电机 PID 调度定时器（10ms 周期中断，pid 模块用；编译闭环只需宏存在）

// 计程定时器（ntb_time 模块读计数）

// 超声波 TRIG/ECHO（sr04 模块：TRIG 输出触发 / ECHO 输入回波；测宽用
// CPU 忙等计数，不占 TIMER 外设——地猛星 SysConfig TIMER 实例仅暴露
// TIMG0/6/7/8/12（已被 motor/pid/ntb_time/servo/step_motor 全占，没有
// 新定时器可加）。默认 TRIG=PB24（与 STEP_MOTOR RST2 重叠）、ECHO=PB8
// （与 STEP_MOTOR DCY2 重叠）——测距与步进同选概率最低，同选时经引脚
// 绑定消解）

