AK47n/firstep/.scratch/magnetometer-modules/matrix/hmc5883l-mspm0/mspm0.syscfg
// 电机方向/使能 + 编码器中断（key 模块 GROUP1_IRQHandler 消费 IIDX）

// 8 路灰度循线输入（引脚空闲位，按实际接线改）

// 启动按键输入（实例名 KEY → KEY_PORT 宏；引脚名 START → KEY_START_PIN）

// 红外对射传感器输入（ir_beam 模块：实例名 IR_BEAM → IR_BEAM_PORT 宏；
// 引脚名 OUT → IR_BEAM_OUT_PIN；默认 PA8——仅与 DIGIT_UART 默认重叠，
// 同选时经引脚绑定消解；内部上拉 = 遮挡（开集输出截止）时由电阻钳到高，
// 无遮挡 = 接收管导通拉低）

// WS2812 幻彩灯带数据脚（ws2812 模块：单 GPIO 强推挽输出，位操作时序；
// 默认 PA14——与 DCC_100_PWM2（step_motor 脉冲）默认重叠，同选时经引脚
// 绑定消解。地猛星 2×20 排针 31 个 IO 已被母版默认布局全占，新模块默认
// 脚按「与同选概率最低者重叠」分配，IR_BEAM/PA8 先例）

// HX711 称重（hx711 模块：SCK 输出 / DT 输入（片上拉，空闲高 = 未就绪，
// 数据就绪拉低）。默认 SCK=PA28（与 IMU601 TX 重叠）、DT=PA31（与 IMU601
// RX 重叠）——称重与串口陀螺仪同为「姿态/力」低频组合，同选概率最低；
// 同选时经引脚绑定消解）

// AHT10 温湿度软 I2C（aht10 模块：SCL 输出 / SDA 双向运行时切换；
// 位操作不占硬件 I2C 外设。默认 SCL=PB6（与 STEP_MOTOR SLP2 / HUIDU R3
// 重叠）、SDA=PB7（与 STEP_MOTOR DIR2 / HUIDU R4 重叠）——温湿度与步进/
// 巡线同选概率最低，同选时经引脚绑定消解；软 I2C 需板上/模块自带上拉）

// HMC5883L 三轴磁力计（电子罗盘，软 I2C 位操作）：SCL=PB6 / SDA=PB7
// 与 AHT10 同脚——罗盘与温湿度同框概率低，且器件地址全异（0x3C/0x3D vs
// 0x70）共挂一条软总线合法；同选时经引脚绑定消解。
HMC5883L.$name = "HMC5883L";
HMC5883L.associatedPins.create(2);
HMC5883L.associatedPins[0].$name        = "SCL";
HMC5883L.associatedPins[0].direction    = "OUTPUT";
HMC5883L.associatedPins[0].initialValue = "CLEARED";
HMC5883L.associatedPins[0].pin.$assign  = "PB6";
HMC5883L.associatedPins[1].$name        = "SDA";
HMC5883L.associatedPins[1].direction    = "OUTPUT";
HMC5883L.associatedPins[1].initialValue = "CLEARED";
HMC5883L.associatedPins[1].pin.$assign  = "PB7";

// DHT11 单总线温湿度（dht11 模块：DATA 双向——输出起始信号/释放总线、
// 输入采样响应与 40bit 数据位，方向运行时切换（照 AHT10_SDA 先例）；
// 位时序 CPU 忙等 + delay 模块换算，不占 TIMER。默认 DATA=PB7——与
// AHT10 SDA（温湿度互替、同选概率最低）/STEP_MOTOR DIR2/HUIDU R4
// 重叠（温湿度与步进/巡线同选概率最低，AHT10 先例），同选时经引脚绑定消解）

// DS18B20 单总线温度（ds18b20 模块：DATA 双向——输出起始/释放总线、输入采样
// 应答与数据位，方向运行时切换（照 DHT11_DATA 先例）；位时序 CPU 忙等 +
// delay 模块换算（复位 750us、位槽 62-64us），不占 TIMER；模块板自带上拉。
// 默认 DATA=PA7——与 DC_MOTOR BIN2（双电机）、SERVO_PWM ccp0（舵机）、
// RC522 CS（读卡门禁）重叠：接触测温与运动控制/读卡不同框、同选概率最低
// （刻意不叠温湿度/光照/显示/语音件——测温+显示/语音/传感站为常见搭配，
// 同 mlx90614 选型口诀；也不叠 I2C_0 的 PA0/PA1——硬件 I2C 脚与 i2c_bus_share
// 测试互扰，批次 5 实测调整先例），同选时经引脚绑定消解）

// BH1750 光照度软 I2C（bh1750 模块：SCL 输出 / SDA 双向运行时切换；
// 位操作不占硬件 I2C 外设，照 AHT10 先例。默认 SCL=PA12 / SDA=PA13——
// 与 PWMAB C0/C1（motor 双路 PWM）重叠：光照度监测/台灯类与双电机驱动
// 同选概率最低（故意不叠 AHT10 的 PB6/PB7——温湿度+光照=环境监测站常见
// 组合），同选时经引脚绑定消解；软 I2C 需板上/模块自带上拉）

// ADS1115 四通道 16bit 外扩 ADC（ads1115 模块：软 I2C 位操作 2 脚 SCL/SDA——
// 照 AHT10 先例不占硬件 I2C 外设；SDA 方向运行时切换（写 = 输出、读 ACK = 输入）。
// 默认 SCL=PA16 / SDA=PA17——与 DC_MOTOR 编码器 AA/AB、RC522 MOSI/MISO 重叠：
// 外扩多通道 ADC 与双电机闭环车/读卡门禁同选概率最低（与库内 adc 板载 12bit
// 单通道分工不同：adc = 板载 ADC12_0 MEM0（默认 PA24，us016 共读同槽），多路
// 模拟量/分离供电用本件——两件同选互不冲突），同选时经引脚绑定消解；
// 软 I2C 需板上/模块自带上拉）

// TCS34725 颜色识别（tcs34725 模块：软 I2C 位操作 2 脚 SCL/SDA——照 AHT10 先例
// 不占硬件 I2C 外设；SDA 方向运行时切换（写 = 输出、读 ACK = 输入）。默认
// SCL=PA23 / SDA=PA24——与 HUIDU L2/L3、UWB/DEBUG/HC05 UART（PA23/PA24）、
// NRF24L01 CSN/CE、ADC12_0 MEM0（adc+us016 共享槽）重叠：颜色识别与无线
// 链路/巡线/板载 ADC 同选概率最低（颜色识别属视觉类，与 K230 视觉互替；
// 刻意不叠 OLED PB2/PB3/MAX7219 显示件——显示颜色值是常见搭配），同选时
// 经引脚绑定消解；软 I2C 需板上/模块自带上拉）

// MLX90614 非接触红外测温（mlx90614 模块：软 I2C/SMBus 兼容位操作 2 脚
// SCL/SDA——照 AHT10 先例不占硬件 I2C 外设；SDA 方向运行时切换（写 = 输出、
// 读 ACK = 输入）。默认 SCL=PA9 / SDA=PA8——与 DIGIT_UART RX/TX（K230 视觉）、
// IR_BEAM OUT、HC05 STATE、JOYSTICK SW、NRF24L01 MISO 重叠：非接触测温与
// 视觉（K230 互替类）/手动输入/蓝牙/2.4G 链路同选概率最低（刻意不叠
// 温湿度/光照/显示——测温与传感站/显示为常见搭配），同选时经引脚绑定
// 消解；软 I2C 需板上/模块自带上拉（SMBus 上拉 4.7k~10k，模块板自带））

// AT24C02 EEPROM 存储（at24c02 模块：软 I2C 位操作 2 脚 SCL/SDA——照 AHT10
// 先例不占硬件 I2C 外设；SDA 方向运行时切换（写 = 输出、读 ACK = 输入）。
// 默认 SCL=PB24 / SDA=PB8——与 STEP_MOTOR RST2/DCY2、SR04 TRIG/ECHO、
// HC05 KEY 重叠：EEPROM 存储记录与步进/测距同选概率最低（记录类与运动类
// 不同框；记录+传感站类同选时与同批 ads1115/tcs34725/mlx90614 默认不撞），
// 同选时经引脚绑定消解；软 I2C 需板上/模块自带上拉）

// SHT30 温湿度软 I2C（sht30 模块：SCL 输出 / SDA 双向运行时切换；
// 位操作不占硬件 I2C 外设，照 AHT10 先例——半周期 5us ≈ 100kHz 级。
// 默认 SCL=PA28 / SDA=PA31——与 IMU601 UART0（+FINGERPRINT_UART）、
// HX711 SCK/DT 重叠：温湿度与姿态/称重/身份采集不同框、同选概率最低
// （刻意不叠 PB6/PB7——aht10 温湿度互替；不叠批次 5 八脚），同选时经引脚
// 绑定消解；软 I2C 需板上/模块自带上拉）

// SHT20 温湿度软 I2C（sht20 模块：SCL 输出 / SDA 双向运行时切换；
// 位操作不占硬件 I2C 外设，照 AHT10 先例——半周期 5us ≈ 100kHz 级；
// 单次测量模式（0xF3 温度/0xF5 湿度 no-hold、低功耗），与 sht30 周期模式
// 分工。默认 SCL=PA16 / SDA=PA17——与 DC_MOTOR 编码器 AA/AB（双电机闭环车）、
// RC522 MOSI/MISO（读卡门禁）、ADS1115 SCL/SDA（外扩多路 ADC）重叠：温湿度
// 与闭环车/读卡/多路模拟采集不同框、同选概率最低（刻意不叠温湿度互替件
// aht10 PB6/PB7、dht11 PB7、sht30 PA28/PA31、ds18b20 PA7、mlx90614 PA9/PA8
// 与光照 bh1750 PA12/PA13——温湿度+显示/其他传感为环境站常见搭配），同选时
// 经引脚绑定消解；软 I2C 需板上/模块自带上拉）

// JY61P 六轴姿态传感器软 I2C（jy61p 模块：SCL 输出 / SDA 双向运行时切换；
// 位操作不占硬件 I2C 外设，照 AHT10 先例。默认 SCL=PA28 / SDA=PA31——与
// IMU601 UART0（imu_uart 姿态互替）、FINGERPRINT_UART（身份）、HX711（称重）、
// SHT30 SDA（温湿度）、MICROWAVE（微波雷达）重叠：姿态测量与身份/称重/温湿度/
// 微波采集不同框、同选概率最低（姿态惯配双电机/舵机/显示/无线——刻意不叠
// motor/step_motor/servo/显示/无线/触摸/语音/气体/报警/红外件与 I2C_0 硬 I2C
// 的 PA0/PA1——软 I2C×硬 I2C 同脚 = 物理冲突分组，批次 5 先例），同选时经
// 引脚绑定消解；软 I2C 需板上/模块自带上拉）

// SGP30 空气 TVOC/CO2e 气体传感（sgp30 模块：软 I2C 位操作 2 脚 SCL/SDA——
// 照 AHT10 先例不占硬件 I2C 外设；SDA 方向运行时切换（写 = 输出、读 ACK =
// 输入）。默认 SCL=PA18 / SDA=PB9——与 DC_MOTOR AIN2/AIN1（双电机）、
// MAX7219 CLK/DIN（大数字显示）、RC522 RST（读卡门禁）重叠：气体传感与
// 运动控制/读卡门禁不同框、同选概率最低（刻意不叠温湿度（AHT10 PB6/PB7、
// DHT11 PB7、DS18B20 PA7、SHT30 PA28/PA31）、光照（PA12/PA13）、OLED 显示
// （PB2/PB3）、语音（PB19/PB20）、按键（PA2、PA22-27）、报警（PA15）、无线
// （PA8/PA9/PA23/PA24）与批次 5 八脚——气体检测器标配温湿度+显示+蜂鸣/灯+
// 键盘，同选概率最高故避开），同选时经引脚绑定消解；软 I2C 需板上/模块
// 自带上拉）

// AGS10 有害气体（TVOC）传感（ags10 模块：软 I2C 位操作 2 脚 SCL/SDA——
// 照 AHT10 先例不占硬件 I2C 外设；SDA 方向运行时切换（写 = 输出、读 ACK =
// 输入）。默认 SCL=PB18 / SDA=PA14——与 DC_MOTOR BIN1（双电机）、MAX7219 CS
// （大数字显示）、DCC_100_PWM2（step_motor 步进脉冲——风机排烟联动）、
// WS2812 IN（灯带指示）、RC522 SCK（读卡门禁）重叠：气体传感与运动控制/读卡/
// 灯带低频同框、同选概率最低（避让原则同 SGP30：不叠温湿度/光照/OLED/语音/
// 按键/报警/无线/批次 5 八脚），同选时经引脚绑定消解；软 I2C 需板上/模块
// 自带上拉）

// BMP180 气压/温度/海拔软 I2C（bmp180 模块：SCL 输出 / SDA 双向运行时切换；
// 位操作不占硬件 I2C 外设/TIMER，照 SHT30/SGP30 先例。默认 SCL=PA23 /
// SDA=PA24——与 HUIDU L2/L3（巡线）、UWB/HC05 链路、NRF24L01 CSN/MOSI、
// TCS34725 SCL/SDA、ADC12_0 板载共读槽（adc 默认脚 PA24/A0_3）重叠：气压/
// 海拔与巡线车控/无线链路/色觉不同框、同选概率最低（刻意不叠温湿度/光照/
// 气体等环境件与显示/语音——气压+环境站/显示为常见搭配；与互替件 ms5611
// 刻意错开），同选时经引脚绑定消解；PA0/PA1 不可作软 I2C SDA（预设事实
// ④——2026-09-06 SysConfig CLI 实证仅禁输入；软 I2C 需板上/模块自带上拉）

// QMC5883L 三轴磁力计 / 电子罗盘软 I2C（qmc5883l 模块：SCL 输出 / SDA 双向
// 运行时切换；位操作不占硬件 I2C 外设/TIMER，照 SHT30/SGP30/BMP180 先例）。
// 默认 SCL=PA23 / SDA=PA24——与 BMP180（气压）默认同脚：罗盘与气压同框概率
// 最低（刻意不叠互替件 ms5611 的 PA28/PA31），且器件地址全异（QMC 0x0D/0x0E
// vs BMP180 0xEE/0xEF）共挂一条软总线协议合法；排针 31 个 IO 已被默认布局
// 占满（IR_BEAM/PA8 先例），同选时经引脚绑定消解；PA0/PA1 不可作软 I2C SDA
//（既定事实④；软 I2C 需板上/模块自带上拉）

