AK47n/firstep/.scratch/magnetometer-modules/matrix/hmc5883l-mspm0/mspm0.syscfg
// MS5611 高精度气压/温度软 I2C（ms5611 模块：SCL 输出 / SDA 双向运行时切换；
// 位操作不占硬件 I2C 外设/TIMER，照 SHT30/SGP30/BMP180 先例。默认 SCL=PA28 /
// SDA=PA31——低频采集池（IMU601/FINGERPRINT_UART/HX711/SHT30/JY61P/
// MICROWAVE/TP_XPT2046/OLED_SPI——姿态/称重/身份/温湿度/微波/显示，jy61p
// 同池先例；MS5611 高精度件与姿态/飞行器定高同框概率最高——池内重叠、同选
// 时经引脚绑定消解；刻意与互替件 bmp180 错开），同选时经引脚绑定消解；
// PA0/PA1 不可作软 I2C SDA（既定事实④——2026-09-06 SysConfig CLI 实证仅禁
// 输入；软 I2C 需板上/模块自带上拉）

// TTP224 4 路电容触摸按键（ttp224 模块：OUT1-4 输入 + 内部上拉——页面
// 「上拉输入」；电平直读无去抖/无 GPIO 中断（GROUP1 仍被 motor 编码器独占，
// 页面同为电平直读）。默认 OUT1=PA22 / OUT2=PA25 / OUT3=PA26 / OUT4=PA27——
// 与 HUIDU L1/L4/R1/R2（巡线）、DEBUG_UART RX/NRF24L01 IRQ、ZIGBEE_UART/
// joystick X-Y/IR_REMOTE/ADC12_0 MEM3（ir_distance）重叠：触摸按键与无线
// 链路/手动输入互替、与巡线/测距不同框，同选概率最低；四脚与同批默认
// （PA7/PA28/PA31/PA24）不撞，同选时经引脚绑定消解）

// 人体红外感应输入（human_ir 模块：OUT 输入 + 内部上拉——HC-SR501 模块被
// 感应到人体时输出高电平（模块介绍「人进入其感应范围则输出高电平」+ 规格
// 「电平输出：高3.3V/低0V」；页面函数注释「0=感应到」与介绍矛盾——按
// HC-SR501 器件标准高=检测到修正，模块 notes 记录）；电平直读无去抖/无
// GPIO 中断（GROUP1 仍被 motor 编码器独占，页面同为电平直读）。默认 PB8——
// 与 STEP_MOTOR DCY2 / SR04 ECHO / AT24C02 SDA 重叠：人体红外与步进/测距/
// 存储不同框、同选概率最低（感应灯/防盗报警惯配温湿度/光照/显示/语音/无线/
// 按键/蜂鸣——刻意不叠），同选时经引脚绑定消解）

// 微波多普勒雷达输入（microwave_radar 模块：OUT 输入 + 内部上拉——HB100
// 模块检测到物体移动时 OUT 低电平（页面函数注释「1=未检测到 0=检测到」+
// main 演示（OUT 输入为 0 判移动）同口径，页面自一致）；电平直读无去抖/无
// GPIO 中断（GROUP1 仍被 motor 编码器独占，页面同为电平直读）；页面演示的
// 开/关门时序逻辑归生成骨架（ADR 0009）。默认 PA31——2026-09-06 SysConfig
// CLI 实证 PA0/PA1 不在 GPIO 输入实例 pin 选项内（"No option named PA0
// defined"；GPIO 输出可配 PA0——ir_remote_tx 先例，输入不可）→ 改选
// PA31：与 IMU601 RX（姿态）/HX711 DT（称重）/FINGERPRINT_UART RX（身份）/
// SHT30 SDA（温湿度）重叠——微波雷达（自动门/车流/倒车）与姿态/称重/身份/
// 温湿度采集不同框、同选概率最低（自动门/车流惯配电机/显示/蜂鸣/无线/超声/
// 人体红外——刻意不叠：PWMAB/MAX7219/LED_BEEP/无线族/SR04 脚/human_ir PB8），
// 同选时经引脚绑定消解；与同批 human_ir（PB8）刻意错开（人体红外+微波组合
// 常同选，默认即不撞）

// GP2Y1014AU 粉尘传感器 LED 驱动输出（gp2y1014au 模块：LED 脉冲驱动——页面
// Read_dust_concentration 时序：clear（LED 亮）→ 280us → 采样 → 40us → set
// （LED 关）→ 9680us，10ms 周期；**器件必需**——GP2Y1014AU 内置红外 LED
// 必须由主控脉冲驱动才能测量，无此脚传感器不工作（薄封装件唯一例外：ADC 仍
// 薄封装共读 MEM0（见 ADC 段），LED 为 GPIO 输出实例）。页面极性原样：
// clear = LED 亮、set = LED 关（空闲高 = 关闭）。默认 PA1——与 I2C_0 sclPin
// （ml_mpu6050 硬 I2C SCL）重叠：粉尘浓度监测与姿态采集不同框、同选概率
// 最低故叠此脚（PA0/PA1 不可作 GPIO 输入——2026-09-06 SysConfig CLI 实证；
// GPIO 输出可配 PA0——ir_remote_tx 先例，PA1 同型经编译矩阵 CLI 实证），
// 同选时经引脚绑定消解；刻意不叠传感站标配（温湿度/光照/气体/显示）、
// 报警（PA15 蜂鸣）、无线/触摸/运动/语音件——粉尘监测站 = 显示 + 报警 +
// 温湿度 + 无线遥测常见组合，默认即不撞）

// 1 路 5V 继电器（relay 模块：OUT 输出——光耦隔离/低电平吸合（IN1 低电平 =
// 光耦导通 = 三极管导通 = 线圈得电 = 触点吸合），5V 驱动 250V/10A 高压负载；
// initialValue SET = 引脚高 = 初始断开（模块低电平吸合，吸合=引脚低；
// relay_init 亦置断开，双保险）。默认 PA1——与 I2C_0 scl（ml_mpu6050 姿态）、
// GP2Y1014 LED（gp2y1014au 粉尘）重叠：继电器与姿态/粉尘不同框、同选概率
// 最低（刻意不叠声光/执行件 LED_BEEP PA15/电机类/风机控制类——继电器+蜂鸣
// 报警/电灯控制为常见组合，默认即不撞），同选时经引脚绑定消解；PA1 可作
// GPIO 输出（2026-09-06 SysConfig CLI 实证仅禁输入——ir_remote_tx 先例；
// 板载 4.7k 上拉对推挽输出无碍）


// 双轴摇杆按键（joystick 模块：SW 输入上拉低有效；实例名 JOYSTICK →
// JOYSTICK_PORT 宏；引脚名 SW → JOYSTICK_SW_PIN；默认 PA9——仅与
// DIGIT_UART RX 默认重叠（K230 视觉串口），同选时经引脚绑定消解。
// X/Y 两轴走 ADC12_0 MEM1/MEM2（见 ADC 段），SW 独立 GPIO）

// HC05 蓝牙（hc05 模块：STATE 输入 = 连接状态指示（模块 STATE 脚高 = 手机
// 已连接；默认 PA8——与 DIGIT_UART TX / IR_BEAM OUT 默认重叠：K230 视觉/
// 红外对射与蓝牙链路互替，同选时经引脚绑定消解）；KEY 输出 = AT 模式切换
// 按键（KEY 高 + 重上电 = AT 命令模式；默认 PB24——与 STEP_MOTOR RST2 /
// SR04 TRIG 重叠，AT 切换不常用，同选时经引脚绑定消解））

// NRF24L01 2.4G 无线（nrf24l01 模块：软 SPI 位操作 6 脚——CLK/MOSI/CSN/CE
// 输出 + MISO/IRQ 输入；IRQ 输入不配中断（GPIO 中断只有 GROUP1 一路且被
// motor 编码器独占——NRF+电机是双车标配组合，定义第二个 GROUP1_IRQHandler
// 会链接期冲突，按手册轮询方式接收）。默认全 GPIOA 单口：CLK=PA26/MOSI=PA25/
// MISO=PA9/CSN=PA24/CE=PA23/IRQ=PA22——与 ZIGBEE_UART（PA26/PA25）、
// UWB/DEBUG_UART（PA23/PA24/PA22）、HUIDU 巡线（PA22-26）、joystick X/Y、
// adc、DIGIT_UART（PA9）默认重叠：NRF 与其它无线/巡线/手动输入互替、同选
// 概率最低，同选时经引脚绑定消解）

// IPS 彩屏（lcd 模块，批次 12 决策 A：六屏合一单模块——ST7735/ST7735S/
// ST7789V2/ST7789V3/GC9A01 差异 = 初始化序列+分辨率+偏移表，lcd_init(型号,
// 方向) 运行时选择；软 SPI 位操作不占硬件 SPI 外设/TIMER——nrf24l01/max7219
// 先例）。六脚全输出：SCL=PA16（与 DC_MOTOR 编码器 AA/RC522 MOSI/ADS1115 SCL/
// SHT20 SCL 重叠）、SDA=PA17（编码器 AB/RC522 MISO/ADS1115 SDA/SHT20 SDA）、
// RES=PA27（与 HUIDU R2/ADC ir_distance/TTP224 OUT4 重叠）、DC=PA22（与 HUIDU
// L1/NRF24L01 IRQ/ZIGBEE DEBUG RX/TTP224 OUT1/flame 重叠）、CS=PB19（与
// JQ8900 语音重叠）、BLK=PB20（与 SYN6288 语音/mq135 重叠）——各对按「同选
// 概率最低者与既有默认重叠」：彩屏与巡线车/无线链路/语音播报/触摸/读卡/
// 气体互替不同框（刻意不叠显示族 oled/max7219/ws2812/led 与环境站温湿度/
// 光照/红外测温/粉尘——彩屏显示环境数据是常见组合；不叠 PA0/PA1——
// i2c_bus_share 测试互扰，批次 5 实测先例），同选时经引脚绑定消解；CS/BLK
// 初始 SET（片选空闲/开背光），其余输出初始 CLEARED。

// XPT2046 电阻触摸（tp_xpt2046 模块，批次 12/06——1.8 寸屏配套独立件，与
// lcd 零耦合：共用 SCLK/MOSI 接线由引脚绑定自选，默认脚独立互不相撞）。
// 五脚：CLK/DIN/CS 输出（CS 初始 SET=片选空闲）+ DOUT/PEN 输入。默认
// CS=PA8（与 DIGIT_UART TX/IR_BEAM/HC05 STATE/MLX90614 SDA/OPENMV4 TX 重叠
// ——触摸与视觉/红外对射/蓝牙链路互替、同选概率最低）、CLK=PA13（与
// PWMAB C1/BH1750 SDA 重叠）、DIN=PA9（与 DIGIT_UART RX/JOYSTICK SW/NRF
// MISO/MLX90614 SCL/OPENMV4 RX 重叠）、DOUT=PA28（与 IMU601/HX711/
// FINGERPRINT_UART/SHT30/JY61P 重叠——姿态/称重/温湿度采集不同框）、
// PEN=PB24（与 STEP_MOTOR RST2/SR04 TRIG/HC05 KEY/AT24C02 SCL/mq5 ADC/
// L298N PWM2 重叠——步进/测距/存储/气体不同框）——各对按「同选概率最低者
// 与既有默认重叠」：触摸与视觉链路/手动输入/姿态/步进不同框，且刻意不叠
// LCD 六脚（PA16/PA17/PA27/PA22/PB19/PB20——触摸与彩屏常同选，默认即不
// 撞），同选时经引脚绑定消解。

// SPI 总线 OLED 0.96 单色屏（oled 模块 SPI 变体，批次 12/07 决策 B——同芯片
// SSD1306 同 API，仅总线层不同：5 脚软 SPI 位操作 SCL/SDA/DC/CS/RES，不占
// 硬件 SPI 外设/TIMER——nrf24l01/max7219 先例；I2C1「OLED」实例与此并存
// （选任一总线时两实例都保留：已知取舍 = SPI 模式下 I2C1 的 PB2/PB3 仍被
// 占用，需要时经引脚绑定换脚消解，见 oled manifest notes）。默认
// SCL=PA28/SDA=PA31（与 IMU601/HX711/FINGERPRINT_UART/SHT30/JY61P/TP DOUT
// 重叠——单色 SPI 屏与姿态/称重/身份/温湿度采集不同框、同选概率最低）、
// DC=PA13（与 PWMAB C1/BH1750 SDA/TP CLK 重叠）、CS=PB18（与 MAX7219 CS/
// AGS10 SCL 重叠——显示互替件同框罕见）、RES=PA22（与 HUIDU L1/NRF IRQ/
// TTP224/flame/TP… 重叠——巡线/无线不同框）——刻意不叠 oled I2C 的 PB2/PB3
// 与彩屏 LCD 六脚，同选时经引脚绑定消解；CS/RES 初始 SET（片选空闲/复位
// 空闲高），其余输出初始 CLEARED。

// 红外遥控接收（ir_remote 模块：OUT 输入（接收头输出直接接 GPIO，上拉 = 无
// 信号高电平、有信号拉低）；NEC 解码用 CPU 忙等采样（delay 模块 20us 步进），
// 不占 TIMER（TIMG 全占，sr04 先例）；主循环轮询解码、不注册 GPIO 中断
// （GROUP1 只有一路且被 motor 编码器独占——红外+电机是经典组合）。默认
// PA26——与 ZIGBEE_TX/joystick X/NRF24L01 CLK 默认重叠（红外与其它无线/
// 手动输入互替、同选概率最低），同选时经引脚绑定消解）

